app/controllers/api/v1/inmuebles_controller.rb

            def index
                inmuebles = Inmueble.order('created_at');
---
SELECT `inmuebles`.* FROM `inmuebles` ORDER BY created_at

            def show
                inmuebles = Inmueble.find(params[:id])
---
SELECT  `inmuebles`.* FROM `inmuebles` WHERE `inmuebles`.`id` = 2 LIMIT 1

            def create
                inmuebles = Inmueble.new(inmuebles_params)
                if inmuebles.save
---
INSERT INTO `inmuebles` (`name`, `type_inmueble`, `street`, `external_number`, `internal_number`, `neighborhood`, `city`, `country`, `rooms`, `bathrooms`, `created_at`, `updated_at`) VALUES ('Casa Campestre en la playa', 'Casa', 'vía a barranquilla', ' paradero 24', 'casa No. 3', 'rodadero', 'Santa Marta', 'CO', 6, 4, '2021-08-26 18:41:16', '2021-08-26 18:41:16')

            def destroy
                inmuebles = Inmueble.find(params[:id])
                if inmuebles.destroy
---
SELECT  `inmuebles`.* FROM `inmuebles` WHERE `inmuebles`.`id` = 4 LIMIT 1
DELETE FROM `inmuebles` WHERE `inmuebles`.`id` = 4

            def update
                inmuebles = Inmueble.find(params[:id])
                if inmuebles.update_attributes(inmuebles_params)
---
SELECT  `inmuebles`.* FROM `inmuebles` WHERE `inmuebles`.`id` = 2 LIMIT 1
UPDATE `inmuebles` SET `name` = 'Casa en el centro de la ciudad', `internal_number` = 'casa cerca a la estación', `updated_at` = '2021-08-26 19:02:24' WHERE `inmuebles`.`id` = 1